# See https://github.com/Homebrew/homebrew-bundle

brew "git"
brew "git-lfs"
brew "tig"
brew "fd"
brew "fzf"
brew "the_silver_searcher"
brew "zsh"
brew "cmake"
brew "tldr"
brew "htop"
brew "watch"
brew "coreutils"
brew "shellcheck"
brew "figlet"
brew "cowsay"

cask "macvim"
cask "dbeaver-community"
cask "hammerspoon"
cask "postman"
cask "monitorcontrol"
cask "quicklook-json"
cask "qlmarkdown"
cask "qlstephen"
cask "qlcolorcode"
cask "grandperspective"
cask "flux"

tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# Kheiron bits
brew "awscli"
brew "python@3.10"
brew "python@3.9"
brew "postgresql@15"

# Currently done through Kheiron installer
#cask "docker"
#cask "vlc"
