# See https://github.com/Homebrew/homebrew-bundle

brew "git"
brew "git-lfs"
brew "tig"
brew "fd"
brew "fzf"
brew "the_silver_searcher"
brew "cmake"
brew "tlrc"
brew "htop"
brew "watch"
brew "coreutils"
brew "shellcheck"
brew "figlet"
brew "cowsay"

cask "macvim"
cask "quicklook-json"
cask "qlmarkdown"
cask "qlstephen"
cask "qlcolorcode"
cask "grandperspective"
cask "flux"
cask "font-hack-nerd-font"

brew "python@3.12"

cask "vlc"
cask "openoffice"
cask "spotify"
